"espk" = "Apple hoparlör kapısı";
"ispk" = "Yerleşik";
"emic" = "Mikrofon kapısı";
"imic" = "Yerleşik";
"hdpn" = "Kulaklık kapısı";
"lini" = "Ses giriş kapısı";
"lino" = "Ses çıkış kapısı";
"spdi" = "Optik sayısal giriş kapısı";
"spdo" = "Optik sayısal çıkış kapısı";
"pci " = "PCI kartı";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Ağ aygıtı";
"blue" = "Bluetooth";
"bluh" = "Bluetooth Kulaklıklar";
"blus" = "Bluetooth Mikrofonlu Kulaklık Seti";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
